{"pageProps":{"headTitle":"clarityhub posts - idmontie's Portfolio","headKeywords":"clarityhub","tag":"clarityhub","posts":[{"slug":"2023-11-19-reboot-clarityhub","date":"2023-11-19","title":"Looking back on Clarity Hub","frontmatter":{"title":"Looking back on Clarity Hub","tags":["clarityhub","startups"]},"contentRaw":"\nIn my projects list on this blog is a set of projects related to Clarity Hub. This was a startup I did with a group of friends where we aimed to create software to enable software product teams to gather customer feedback, and then action on it.\n\nI’ve been thinking about rebooting Clarity Hub for some time. When I was devoting my time to the Clarity Hub startup, the offering was split into two parts: 1. Interviewing software for product teams, and 2. an AI and NLP set of APIs for inference and predictions.\n\nWe ended up open sourcing as much of our Clarity Hub code as we could: [Clarity Hub on Github](https://github.com/Clarityhub). This included all of our original code pivots as well. While interviewing with a few startups, a couple asked me for details on Clarity Hub and how we approached the problem domain, architectural decisions, and software design. All these notes ended up as part of the README: [Architecture notes on Github](https://github.com/clarityhub/clarityhub-server-core).\n\nLooking at all these diagrams, seeing all the incredible work I did with my small team on Clarity Hub, I can see that a lot has changed since we tackled this problem.\n\nThe first major change is that Notion has become a common name in note-taking. I consider myself an early adopter of Notion and have referred many friends over to it. Clarity Hub as a Notion for Product Teams seems very useless now, especially with the second change in consideration.\n\nThe second major change being how far AI and NLP came within just a few years. Focusing on this as our differentiator is now irrelevant. Notion has released their API, new AI tools, and a plethora of other features. And while Notion doesn’t provide an easy way to record, video call, automatically transcribe meetings, and pull topics from conversations, this seems pretty trivial to add as a Notion extension. I think Dovetail will be in the same boat. As OpenAI continues to provide more powerful models, and makes them easy to use, well positioned apps like Notion will be able to continue to get better.\n\nBut not is all lost, part of failing as a start-up is at least learning a lot.\n\n## Microservices, but not really\n\nLooking back on our startup adventure, one thing I’d recommend for a new business just trying to start out is to think about microservices, but not fully committing to the complexity of microservices. We approached this by making the entire application in Serverless, using lambdas for each main endpoint that was needed as lambdas to handle asynchronous services. This let us share code, but move quickly.\n\n## Billing\n\nBilling is one of those items that can easily become a time-sync – and it did. Looking back, I feel like we wasted so much time, effort, and thought on billing. If I had to do Clarity Hub over again, I’d ignore billing for just Free Trial and Contact Sales for custom billing.\n\nWithout customers, there’s no point in building a billing system, especially when you don’t know what type of customers you will have.\n\nWe definitely learned a lot about Stripe and how to build in eventing into our systems to help support billing cycles, upgrading, and more.\n\nWe also spent very little time looking into alternative billing providers, since we were part of Stripe Atlas. One that has always interested me was Lago, since it is available as Open Source and a hosted solution.\n\n## Conflict-free replicated data types\n\nWe originally used Slate for our editor, and as is usual in programming, they went through a major version bump right after we finished our original implementation. I wish we had investigated Conflict-free replicated data types for this more and built-in real-time multi-user editing for notes early in the development stage.\n\nImplementing a basic solution for this would have been well worth it from a learning perspective, and from a code-reusability perspective. As is, a lot of the editor code is obsolete and tightly coupled with the specific version of slate that we used.\n\n## Conclusion\n\nIf I could do Clarity Hub all over again, I would. It was a great learning and growing experience for me, and I’ve often looked back on what we did and thought about rebooting Clarity Hub. But when I look around the current technology landscape, I think the scope of the product and its main differentiators would have to change dramatically.\n","contentHTML":"<p>In my projects list on this blog is a set of projects related to Clarity Hub. This was a startup I did with a group of friends where we aimed to create software to enable software product teams to gather customer feedback, and then action on it.</p>\n<p>I’ve been thinking about rebooting Clarity Hub for some time. When I was devoting my time to the Clarity Hub startup, the offering was split into two parts: 1. Interviewing software for product teams, and 2. an AI and NLP set of APIs for inference and predictions.</p>\n<p>We ended up open sourcing as much of our Clarity Hub code as we could: <a href=\"https://github.com/Clarityhub\">Clarity Hub on Github</a>. This included all of our original code pivots as well. While interviewing with a few startups, a couple asked me for details on Clarity Hub and how we approached the problem domain, architectural decisions, and software design. All these notes ended up as part of the README: <a href=\"https://github.com/clarityhub/clarityhub-server-core\">Architecture notes on Github</a>.</p>\n<p>Looking at all these diagrams, seeing all the incredible work I did with my small team on Clarity Hub, I can see that a lot has changed since we tackled this problem.</p>\n<p>The first major change is that Notion has become a common name in note-taking. I consider myself an early adopter of Notion and have referred many friends over to it. Clarity Hub as a Notion for Product Teams seems very useless now, especially with the second change in consideration.</p>\n<p>The second major change being how far AI and NLP came within just a few years. Focusing on this as our differentiator is now irrelevant. Notion has released their API, new AI tools, and a plethora of other features. And while Notion doesn’t provide an easy way to record, video call, automatically transcribe meetings, and pull topics from conversations, this seems pretty trivial to add as a Notion extension. I think Dovetail will be in the same boat. As OpenAI continues to provide more powerful models, and makes them easy to use, well positioned apps like Notion will be able to continue to get better.</p>\n<p>But not is all lost, part of failing as a start-up is at least learning a lot.</p>\n<h2>Microservices, but not really</h2>\n<p>Looking back on our startup adventure, one thing I’d recommend for a new business just trying to start out is to think about microservices, but not fully committing to the complexity of microservices. We approached this by making the entire application in Serverless, using lambdas for each main endpoint that was needed as lambdas to handle asynchronous services. This let us share code, but move quickly.</p>\n<h2>Billing</h2>\n<p>Billing is one of those items that can easily become a time-sync – and it did. Looking back, I feel like we wasted so much time, effort, and thought on billing. If I had to do Clarity Hub over again, I’d ignore billing for just Free Trial and Contact Sales for custom billing.</p>\n<p>Without customers, there’s no point in building a billing system, especially when you don’t know what type of customers you will have.</p>\n<p>We definitely learned a lot about Stripe and how to build in eventing into our systems to help support billing cycles, upgrading, and more.</p>\n<p>We also spent very little time looking into alternative billing providers, since we were part of Stripe Atlas. One that has always interested me was Lago, since it is available as Open Source and a hosted solution.</p>\n<h2>Conflict-free replicated data types</h2>\n<p>We originally used Slate for our editor, and as is usual in programming, they went through a major version bump right after we finished our original implementation. I wish we had investigated Conflict-free replicated data types for this more and built-in real-time multi-user editing for notes early in the development stage.</p>\n<p>Implementing a basic solution for this would have been well worth it from a learning perspective, and from a code-reusability perspective. As is, a lot of the editor code is obsolete and tightly coupled with the specific version of slate that we used.</p>\n<h2>Conclusion</h2>\n<p>If I could do Clarity Hub all over again, I would. It was a great learning and growing experience for me, and I’ve often looked back on what we did and thought about rebooting Clarity Hub. But when I look around the current technology landscape, I think the scope of the product and its main differentiators would have to change dramatically.</p>","contentCode":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\",\n    a: \"a\",\n    h2: \"h2\"\n  }, props.components);\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"In my projects list on this blog is a set of projects related to Clarity Hub. This was a startup I did with a group of friends where we aimed to create software to enable software product teams to gather customer feedback, and then action on it.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"I’ve been thinking about rebooting Clarity Hub for some time. When I was devoting my time to the Clarity Hub startup, the offering was split into two parts: 1. Interviewing software for product teams, and 2. an AI and NLP set of APIs for inference and predictions.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"We ended up open sourcing as much of our Clarity Hub code as we could: \", _jsx(_components.a, {\n        href: \"https://github.com/Clarityhub\",\n        children: \"Clarity Hub on Github\"\n      }), \". This included all of our original code pivots as well. While interviewing with a few startups, a couple asked me for details on Clarity Hub and how we approached the problem domain, architectural decisions, and software design. All these notes ended up as part of the README: \", _jsx(_components.a, {\n        href: \"https://github.com/clarityhub/clarityhub-server-core\",\n        children: \"Architecture notes on Github\"\n      }), \".\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Looking at all these diagrams, seeing all the incredible work I did with my small team on Clarity Hub, I can see that a lot has changed since we tackled this problem.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The first major change is that Notion has become a common name in note-taking. I consider myself an early adopter of Notion and have referred many friends over to it. Clarity Hub as a Notion for Product Teams seems very useless now, especially with the second change in consideration.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"The second major change being how far AI and NLP came within just a few years. Focusing on this as our differentiator is now irrelevant. Notion has released their API, new AI tools, and a plethora of other features. And while Notion doesn’t provide an easy way to record, video call, automatically transcribe meetings, and pull topics from conversations, this seems pretty trivial to add as a Notion extension. I think Dovetail will be in the same boat. As OpenAI continues to provide more powerful models, and makes them easy to use, well positioned apps like Notion will be able to continue to get better.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But not is all lost, part of failing as a start-up is at least learning a lot.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Microservices, but not really\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Looking back on our startup adventure, one thing I’d recommend for a new business just trying to start out is to think about microservices, but not fully committing to the complexity of microservices. We approached this by making the entire application in Serverless, using lambdas for each main endpoint that was needed as lambdas to handle asynchronous services. This let us share code, but move quickly.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Billing\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Billing is one of those items that can easily become a time-sync – and it did. Looking back, I feel like we wasted so much time, effort, and thought on billing. If I had to do Clarity Hub over again, I’d ignore billing for just Free Trial and Contact Sales for custom billing.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Without customers, there’s no point in building a billing system, especially when you don’t know what type of customers you will have.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"We definitely learned a lot about Stripe and how to build in eventing into our systems to help support billing cycles, upgrading, and more.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"We also spent very little time looking into alternative billing providers, since we were part of Stripe Atlas. One that has always interested me was Lago, since it is available as Open Source and a hosted solution.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Conflict-free replicated data types\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"We originally used Slate for our editor, and as is usual in programming, they went through a major version bump right after we finished our original implementation. I wish we had investigated Conflict-free replicated data types for this more and built-in real-time multi-user editing for notes early in the development stage.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Implementing a basic solution for this would have been well worth it from a learning perspective, and from a code-reusability perspective. As is, a lot of the editor code is obsolete and tightly coupled with the specific version of slate that we used.\"\n    }), \"\\n\", _jsx(_components.h2, {\n      children: \"Conclusion\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"If I could do Clarity Hub all over again, I would. It was a great learning and growing experience for me, and I’ve often looked back on what we did and thought about rebooting Clarity Hub. But when I look around the current technology landscape, I think the scope of the product and its main differentiators would have to change dramatically.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = props.components || ({});\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","excerptRaw":"\nIn my projects list on this blog is a set of projects related to Clarity Hub. This was a startup I did with a group of friends where we aimed to create software to enable software product teams to gather customer feedback, and then action on it.","excerptHTML":"<p>In my projects list on this blog is a set of projects related to Clarity Hub. This was a startup I did with a group of friends where we aimed to create software to enable software product teams to gather customer feedback, and then action on it.</p>","excerptCode":"/*@jsxRuntime automatic @jsxImportSource react*/\nconst {jsx: _jsx} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = Object.assign({\n    p: \"p\"\n  }, props.components);\n  return _jsx(_components.p, {\n    children: \"In my projects list on this blog is a set of projects related to Clarity Hub. This was a startup I did with a group of friends where we aimed to create software to enable software product teams to gather customer feedback, and then action on it.\"\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = props.components || ({});\n  return MDXLayout ? _jsx(MDXLayout, Object.assign({}, props, {\n    children: _jsx(_createMdxContent, props)\n  })) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","tags":["clarityhub","startups"]}]},"__N_SSG":true}