{"pageProps":{"headTitle":"career posts - idmontie's Portfolio","headKeywords":"career","tag":"career","posts":[{"slug":"2023-09-24-impostor-syndrome","date":"2023-09-24","title":"In Good Company, Impostor Syndrome","frontmatter":{"title":"In Good Company, Impostor Syndrome","tags":["career"]},"contentRaw":"\nWe've all felt it at some point in our careers: that dreaded feeling of impostor syndrome kicking in as we find ourselves in over our heads. Questions like, \"Am I truly qualified for this?\" and \"Are my peers facing the same challenges?\" often plague our minds.\n\nImpostor syndrome is such a universal experience that countless articles, conference talks, and books have been dedicated to the topic.\n\nBut is this just a human emotion? I think impostor syndrome also applies to startups and companies as well. While a lot less universal, some of us in the tech world have had the misfortune of working at such impostor syndrome companies. And that anxiety manifests itself into doubt in the employees, bringing everyone down.\n\n> For example, many startups use Jira because large companies use Jira.\n>\n> - https://blog.johnqian.com/startup-spark\n\nWhether or not you like JIRA, the startup impostor syndrome manifests itself in similar ways: pick safe tech that larger companies use. It must be good because the larger company we think is successful uses it. Emulate success and surely we will be successful.\n\nOr it may show up in processes. A manager comes into a startup from a large successful company and blindly imposes large corporate processes to the small company. Everything slows down, dampening the enthusiasm of the team. Emulate the processes of a large company and surely we will be successful.\n\nThis mindset isn't new. The old adage \"[No one has ever been fired for buying IBM](https://www.origina.com/blog/nobody-ever-got-fired-for-buying-ibm)\" highlights the tendency to play it safe in the face of doubt. When we have doubt, even as a company, we like to play it safe; but, innovation and large payoffs don't happen from playing it safe. They come from risk and opportunity.\n\nWhen we play it too safe, too cautiously, we are giving into that impostor syndrome and settling for good enough. In our personal lives and in business, emulating success is usually just a facade for fear of risk. It's difficult to go out there and create new processes when you are so used to an old process you learned at a larger company. It's difficult to go out there and pick a technology that no one is using compared to one that a large company is using. And it's difficult to go out there and solve problems you think are over your head.\n\nThat feeling of impostor syndrome is good. It means you are pushing your limits and getting out of your comfort zone. You are tackling problems you haven't experienced before. And if you don't just try to emulate others, you might make mistakes, but they are your learning opportunities for growth. Then you can look back and see how far you've come, not by playing it safe and fearing impostor syndrome, but by embracing it.\n","contentHTML":"<p>We&#x27;ve all felt it at some point in our careers: that dreaded feeling of impostor syndrome kicking in as we find ourselves in over our heads. Questions like, &quot;Am I truly qualified for this?&quot; and &quot;Are my peers facing the same challenges?&quot; often plague our minds.</p>\n<p>Impostor syndrome is such a universal experience that countless articles, conference talks, and books have been dedicated to the topic.</p>\n<p>But is this just a human emotion? I think impostor syndrome also applies to startups and companies as well. While a lot less universal, some of us in the tech world have had the misfortune of working at such impostor syndrome companies. And that anxiety manifests itself into doubt in the employees, bringing everyone down.</p>\n<blockquote class=\"border-l-4 border-gray-300 pl-4\">\n<p>For example, many startups use Jira because large companies use Jira.</p>\n<ul>\n<li><a href=\"https://blog.johnqian.com/startup-spark\">https://blog.johnqian.com/startup-spark</a></li>\n</ul>\n</blockquote>\n<p>Whether or not you like JIRA, the startup impostor syndrome manifests itself in similar ways: pick safe tech that larger companies use. It must be good because the larger company we think is successful uses it. Emulate success and surely we will be successful.</p>\n<p>Or it may show up in processes. A manager comes into a startup from a large successful company and blindly imposes large corporate processes to the small company. Everything slows down, dampening the enthusiasm of the team. Emulate the processes of a large company and surely we will be successful.</p>\n<p>This mindset isn&#x27;t new. The old adage &quot;<a href=\"https://www.origina.com/blog/nobody-ever-got-fired-for-buying-ibm\">No one has ever been fired for buying IBM</a>&quot; highlights the tendency to play it safe in the face of doubt. When we have doubt, even as a company, we like to play it safe; but, innovation and large payoffs don&#x27;t happen from playing it safe. They come from risk and opportunity.</p>\n<p>When we play it too safe, too cautiously, we are giving into that impostor syndrome and settling for good enough. In our personal lives and in business, emulating success is usually just a facade for fear of risk. It&#x27;s difficult to go out there and create new processes when you are so used to an old process you learned at a larger company. It&#x27;s difficult to go out there and pick a technology that no one is using compared to one that a large company is using. And it&#x27;s difficult to go out there and solve problems you think are over your head.</p>\n<p>That feeling of impostor syndrome is good. It means you are pushing your limits and getting out of your comfort zone. You are tackling problems you haven&#x27;t experienced before. And if you don&#x27;t just try to emulate others, you might make mistakes, but they are your learning opportunities for growth. Then you can look back and see how far you&#x27;ve come, not by playing it safe and fearing impostor syndrome, but by embracing it.</p>","contentCode":"\"use strict\";\nconst {Fragment: _Fragment, jsx: _jsx, jsxs: _jsxs} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = {\n    a: \"a\",\n    blockquote: \"blockquote\",\n    li: \"li\",\n    p: \"p\",\n    ul: \"ul\",\n    ...props.components\n  };\n  return _jsxs(_Fragment, {\n    children: [_jsx(_components.p, {\n      children: \"We've all felt it at some point in our careers: that dreaded feeling of impostor syndrome kicking in as we find ourselves in over our heads. Questions like, \\\"Am I truly qualified for this?\\\" and \\\"Are my peers facing the same challenges?\\\" often plague our minds.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Impostor syndrome is such a universal experience that countless articles, conference talks, and books have been dedicated to the topic.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"But is this just a human emotion? I think impostor syndrome also applies to startups and companies as well. While a lot less universal, some of us in the tech world have had the misfortune of working at such impostor syndrome companies. And that anxiety manifests itself into doubt in the employees, bringing everyone down.\"\n    }), \"\\n\", _jsxs(_components.blockquote, {\n      children: [\"\\n\", _jsx(_components.p, {\n        children: \"For example, many startups use Jira because large companies use Jira.\"\n      }), \"\\n\", _jsxs(_components.ul, {\n        children: [\"\\n\", _jsx(_components.li, {\n          children: _jsx(_components.a, {\n            href: \"https://blog.johnqian.com/startup-spark\",\n            children: \"https://blog.johnqian.com/startup-spark\"\n          })\n        }), \"\\n\"]\n      }), \"\\n\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Whether or not you like JIRA, the startup impostor syndrome manifests itself in similar ways: pick safe tech that larger companies use. It must be good because the larger company we think is successful uses it. Emulate success and surely we will be successful.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"Or it may show up in processes. A manager comes into a startup from a large successful company and blindly imposes large corporate processes to the small company. Everything slows down, dampening the enthusiasm of the team. Emulate the processes of a large company and surely we will be successful.\"\n    }), \"\\n\", _jsxs(_components.p, {\n      children: [\"This mindset isn't new. The old adage \\\"\", _jsx(_components.a, {\n        href: \"https://www.origina.com/blog/nobody-ever-got-fired-for-buying-ibm\",\n        children: \"No one has ever been fired for buying IBM\"\n      }), \"\\\" highlights the tendency to play it safe in the face of doubt. When we have doubt, even as a company, we like to play it safe; but, innovation and large payoffs don't happen from playing it safe. They come from risk and opportunity.\"]\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"When we play it too safe, too cautiously, we are giving into that impostor syndrome and settling for good enough. In our personal lives and in business, emulating success is usually just a facade for fear of risk. It's difficult to go out there and create new processes when you are so used to an old process you learned at a larger company. It's difficult to go out there and pick a technology that no one is using compared to one that a large company is using. And it's difficult to go out there and solve problems you think are over your head.\"\n    }), \"\\n\", _jsx(_components.p, {\n      children: \"That feeling of impostor syndrome is good. It means you are pushing your limits and getting out of your comfort zone. You are tackling problems you haven't experienced before. And if you don't just try to emulate others, you might make mistakes, but they are your learning opportunities for growth. Then you can look back and see how far you've come, not by playing it safe and fearing impostor syndrome, but by embracing it.\"\n    })]\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = props.components || ({});\n  return MDXLayout ? _jsx(MDXLayout, {\n    ...props,\n    children: _jsx(_createMdxContent, {\n      ...props\n    })\n  }) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","excerptRaw":"\nWe've all felt it at some point in our careers: that dreaded feeling of impostor syndrome kicking in as we find ourselves in over our heads. Questions like, \"Am I truly qualified for this?\" and \"Are my peers facing the same challenges?\" often plague our minds.","excerptHTML":"<p>We&#x27;ve all felt it at some point in our careers: that dreaded feeling of impostor syndrome kicking in as we find ourselves in over our heads. Questions like, &quot;Am I truly qualified for this?&quot; and &quot;Are my peers facing the same challenges?&quot; often plague our minds.</p>","excerptCode":"\"use strict\";\nconst {jsx: _jsx} = arguments[0];\nfunction _createMdxContent(props) {\n  const _components = {\n    p: \"p\",\n    ...props.components\n  };\n  return _jsx(_components.p, {\n    children: \"We've all felt it at some point in our careers: that dreaded feeling of impostor syndrome kicking in as we find ourselves in over our heads. Questions like, \\\"Am I truly qualified for this?\\\" and \\\"Are my peers facing the same challenges?\\\" often plague our minds.\"\n  });\n}\nfunction MDXContent(props = {}) {\n  const {wrapper: MDXLayout} = props.components || ({});\n  return MDXLayout ? _jsx(MDXLayout, {\n    ...props,\n    children: _jsx(_createMdxContent, {\n      ...props\n    })\n  }) : _createMdxContent(props);\n}\nreturn {\n  default: MDXContent\n};\n","tags":["career"]}]},"__N_SSG":true}